fontes/NFe.Components.Wsdl/NFe/WSDL/Producao/MS/PMSNfeCadConsultaCadastro.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.2-b608 (trunk-7979; 2015-01-21T12:50:19+0000) JAXWS-RI/2.2.11-b150120.1832 JAXWS-API/2.2.12 JAXB-RI/2.2.12-b141219.1637 JAXB-API/2.2.13-b141020.1521 svn-revision#unknown. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.2-b608 (trunk-7979; 2015-01-21T12:50:19+0000) JAXWS-RI/2.2.11-b150120.1832 JAXWS-API/2.2.12 JAXB-RI/2.2.12-b141219.1637 JAXB-API/2.2.13-b141020.1521 svn-revision#unknown. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/CadConsultaCadastro4" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/CadConsultaCadastro4" name="CadConsultaCadastro4">
<types>
<xsd:schema>
<xsd:import namespace="http://www.portalfiscal.inf.br/nfe/wsdl/CadConsultaCadastro4" schemaLocation="https://nfe.fazenda.ms.gov.br:443/ws/CadConsultaCadastro4?xsd=1"/>
</xsd:schema>
</types>
<message name="consultaCadastro">
<part name="nfeDadosMsg" element="tns:nfeDadosMsg"/>
</message>
<message name="consultaCadastroResponse">
<part name="consultaCadastroResult" element="tns:consultaCadastroResult"/>
</message>
<portType name="CadConsultaCadastroSoap">
<operation name="consultaCadastro">
<input wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/CadConsultaCadastro4/consultaCadastro" message="tns:consultaCadastro"/>
<output wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/CadConsultaCadastro4/CadConsultaCadastroSoap/consultaCadastroResponse" message="tns:consultaCadastroResponse"/>
</operation>
</portType>
<binding name="cadConsultaCadastroSoap12Binding" type="tns:CadConsultaCadastroSoap">
<soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="consultaCadastro">
<soap12:operation soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/CadConsultaCadastro4/consultaCadastro"/>
<input>
<soap12:body use="literal"/>
</input>
<output>
<soap12:body use="literal"/>
</output>
</operation>
</binding>
<service name="CadConsultaCadastro4">
<port name="cadConsultaCadastroSoap12" binding="tns:cadConsultaCadastroSoap12Binding">
<soap12:address location="https://nfe.fazenda.ms.gov.br:443/ws/CadConsultaCadastro4"/>
</port>
</service>
</definitions>