schema.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/CadConsultaCadastro4"><soap:Header></soap:Header><soap:Body><consultaCadastro xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/CadConsultaCadastro4"><ConsCad><versao>4.00</versao><infCons><xServ>CONS-CAD</xServ><UF>MT</UF><CNPJ>26535443000170</CNPJ></infCons></ConsCad></consultaCadastro></soap:Body></soap:Envelope>
